app/views/privates/_users.html.erb

<ul class="list-group">
	<% User.all.where.not(id: current_user.id).each do |user| %>
---
SELECT `users`.* FROM `users`