app/views/rooms/_rooms_menu.html.erb

SELECT `rooms`.* FROM `rooms`
---
  <ul class="nav nav-tabs tabs-left"><!-- 'tabs-right' for right tabs -->
    <% Room.all.each do |room| %>