app/views/rooms/show.html.erb

SELECT `room_messages`.* FROM `room_messages` WHERE `room_messages`.`room_id` = 1
---
<div id="message_chat_room_<%= @room.id%>" class="col-xs-8 well" style="margin-bottom: 0px; border-radius: 0; min-height: 300px;">
<% @room.room_messages.each do |message|%>