app/controllers/rooms_controller.rb

INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES ('Golaaa', '2017-03-29 02:46:45', '2017-03-29 02:46:45')
---
	def create
		@room = Room.new room_param
		if @room.save

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
---
		def set_room
			@room = Room.find(params[:id])